
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	ИмяПользователяИБ = ПользовательИБ.Имя;
	СсылкаНаПользователя = Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователяИБ);
	
	Если СсылкаНаПользователя.Пустая() Тогда
		НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
		НовыйПользователь.Наименование = ПользовательИБ.Имя;
		НовыйПользователь.ПолноеИмя = ПользовательИБ.ПолноеИмя;
		НовыйПользователь.Записать();
		СсылкаНаПользователя = НовыйПользователь.Ссылка;
	КонецЕсли;
	
	ПараметрыСеанса.ТекущийПользователь = СсылкаНаПользователя;	
		
КонецПроцедуры
