
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтотОбъект.Параметры.Свойство("ЗначенияЗаполнения") И ЭтотОбъект.Параметры.ЗначенияЗаполнения.Свойство("АдресДанных") Тогда 
		АдресДанных = ЭтотОбъект.Параметры.ЗначенияЗаполнения.АдресДанных;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(АдресДанных) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресДанных);
		ТекущийОбъект.ФайлКандидата = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));		
	КонецЕсли;
		
КонецПроцедуры
