
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ЗаявкаНаПодбор.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаНаПодбор.ВакантнаяДолжность КАК ВакантнаяДолжность,
	|	ЗаявкаНаПодбор.ГрафикРаботы КАК ГрафикРаботы,
	|	ЗаявкаНаПодбор.ОплатаТрудаДо КАК ЗаработнаяПлатаДо,
	|	ЗаявкаНаПодбор.ОплатаТрудаОт КАК ЗаработнаяПлатаОт,
	|	ЗаявкаНаПодбор.ИнициаторЗаявки КАК ИнициаторЗаявки,
	|	ЗаявкаНаПодбор.КоличествоЧеловек КАК КоличествоНеобходимыхЧеловек,
	|	ЗаявкаНаПодбор.Номер КАК Номер,
	|	ЗаявкаНаПодбор.Образование КАК Образование,
	|	ЗаявкаНаПодбор.ОпытРаботы КАК ОпытРаботы,
	|	ЗаявкаНаПодбор.ПланируемыйСрокЗакрытия КАК ПланируемыйСрокЗакрытия,
	|	ЗаявкаНаПодбор.Подразделение КАК Подразделение,
	|	ЗаявкаНаПодбор.ПричинаОткрытияВакансии КАК ПричинаОткрытияВакансии,
	|	ЗаявкаНаПодбор.ТипЗанятости КАК ТипЗанятости,
	|	ЗаявкаНаПодбор.ПрофессиональныеНавыки.(
	|		НомерСтроки КАК НомерСтроки,
	|		Навык КАК Навык,
	|		УровеньВладения КАК УровеньВладения
	|	) КАК ПрофессиональныеНавыки,
	|	ЗаявкаНаПодбор.ЗнанияЯзыков.(
	|		НомерСтроки КАК НомерСтроки,
	|		Язык КАК Язык,
	|		УровеньВладения КАК УровеньВладения
	|	) КАК ИностранныеЯзыки,
	|	ЗаявкаНаПодбор.КатегорияДолжности КАК КатегорияДолжности,
	|	ЗаявкаНаПодбор.ФорматРаботы КАК ФорматРаботы
	|ИЗ
	|	Документ.ЗаявкаНаПодбор КАК ЗаявкаНаПодбор
	|ГДЕ
	|	ЗаявкаНаПодбор.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПрофессиональныеНавыкиШапка = Макет.ПолучитьОбласть("ПрофессиональныеНавыкиШапка");
	ОбластьПрофессиональныеНавыки = Макет.ПолучитьОбласть("ПрофессиональныеНавыки");
	ОбластьИностранныеЯзыкиШапка = Макет.ПолучитьОбласть("ИностранныеЯзыкиШапка");
	ОбластьИностранныеЯзыки = Макет.ПолучитьОбласть("ИностранныеЯзыки");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
       	ОбластьЗаголовок.Параметры.Номер = Выборка.Номер;
		ТабДок.Вывести(ОбластьЗаголовок);
		Шапка.Параметры.Заполнить(Выборка);
		
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПрофессиональныеНавыкиШапка);
		ВыборкаПрофессиональныеНавыки = Выборка.ПрофессиональныеНавыки.Выбрать();
		Пока ВыборкаПрофессиональныеНавыки.Следующий() Цикл
			ОбластьПрофессиональныеНавыки.Параметры.Заполнить(ВыборкаПрофессиональныеНавыки);
			ТабДок.Вывести(ОбластьПрофессиональныеНавыки, ВыборкаПрофессиональныеНавыки.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьИностранныеЯзыкиШапка);
		ВыборкаИностранныеЯзыки = Выборка.ИностранныеЯзыки.Выбрать();
		Пока ВыборкаИностранныеЯзыки.Следующий() Цикл
			ОбластьИностранныеЯзыки.Параметры.Заполнить(ВыборкаИностранныеЯзыки);
			ТабДок.Вывести(ОбластьИностранныеЯзыки, ВыборкаИностранныеЯзыки.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
	Подвал.Параметры.ДолжностьИнициатора = Выборка.ИнициаторЗаявки.Должность.Наименование;
	Подвал.Параметры.ФИОИнициатора = Выборка.ИнициаторЗаявки.Наименование;		
	Подвал.Параметры.ТелефонИнициатора = Выборка.ИнициаторЗаявки.РабочийТелефон;		
	Подвал.Параметры.ПочтаИнициатора = Выборка.ИнициаторЗаявки.Эмаил;		


	ТабДок.Вывести(Подвал);
	
	//}}
КонецПроцедуры
