
Процедура Печать(ТабДок, Ссылка) Экспорт

	Макет = Документы.ЗаявкаНаПодбор.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаНаПодбор.ВакантнаяДолжность КАК ВакантнаяДолжность,
	|	ЗаявкаНаПодбор.ГрафикРаботы КАК ГрафикРаботы,
	|	ЗаявкаНаПодбор.ОплатаТрудаДо КАК ЗаработнаяПлатаДо,
	|	ЗаявкаНаПодбор.ОплатаТрудаОт КАК ЗаработнаяПлатаОт,
	|	ЗаявкаНаПодбор.ИнициаторЗаявки КАК ИнициаторЗаявки,
	|	ЗаявкаНаПодбор.КоличествоЧеловек КАК КоличествоНеобходимыхЧеловек,
	|	ЗаявкаНаПодбор.Номер КАК Номер,
	|	ЗаявкаНаПодбор.Образование КАК Образование,
	|	ЗаявкаНаПодбор.ОпытРаботы КАК ОпытРаботы,
	|	ЗаявкаНаПодбор.ПланируемыйСрокЗакрытия КАК ПланируемыйСрокЗакрытия,
	|	ЗаявкаНаПодбор.Подразделение КАК Подразделение,
	|	ЗаявкаНаПодбор.ПричинаОткрытияВакансии КАК ПричинаОткрытияВакансии,
	|	ЗаявкаНаПодбор.ТипЗанятости КАК ТипЗанятости,
	|	ЗаявкаНаПодбор.КлючевыеНавыки.(
	|		НомерСтроки КАК НомерСтроки,
	|		Навык КАК Навык,
	|		УровеньВладения КАК УровеньВладения
	|	) КАК КлючевыеНавыки,
	|	ЗаявкаНаПодбор.ЗнанияЯзыков.(
	|		НомерСтроки КАК НомерСтроки,
	|		Язык КАК Язык,
	|		УровеньВладения КАК УровеньВладения
	|	) КАК Языки,
	|	ЗаявкаНаПодбор.КатегорияДолжности КАК КатегорияДолжности,
	|	ЗаявкаНаПодбор.ФорматРаботы КАК ФорматРаботы
	|ИЗ
	|	Документ.ЗаявкаНаПодбор КАК ЗаявкаНаПодбор
	|ГДЕ
	|	ЗаявкаНаПодбор.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьКлючевыеНавыкиШапка = Макет.ПолучитьОбласть("КлючевыеНавыкиШапка");
	ОбластьКлючевыеНавыки = Макет.ПолучитьОбласть("КлючевыеНавыки");
	ОбластьЯзыкиШапка = Макет.ПолучитьОбласть("ЯзыкиШапка");
	ОбластьЯзыки = Макет.ПолучитьОбласть("Языки");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
       	ОбластьЗаголовок.Параметры.Номер = Выборка.Номер;
		ТабДок.Вывести(ОбластьЗаголовок);
		Шапка.Параметры.Заполнить(Выборка);
		
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьКлючевыеНавыкиШапка);
		ВыборкаКлючевыеНавыки = Выборка.КлючевыеНавыки.Выбрать();
		Пока ВыборкаКлючевыеНавыки.Следующий() Цикл
			ОбластьКлючевыеНавыки.Параметры.Заполнить(ВыборкаКлючевыеНавыки);
			ТабДок.Вывести(ОбластьКлючевыеНавыки, ВыборкаКлючевыеНавыки.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьЯзыкиШапка);
		ВыборкаЯзыки = Выборка.Языки.Выбрать();
		Пока ВыборкаЯзыки.Следующий() Цикл
			ОбластьЯзыки.Параметры.Заполнить(ВыборкаЯзыки);
			ТабДок.Вывести(ОбластьЯзыки, ВыборкаЯзыки.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
	Подвал.Параметры.ДолжностьИнициатора = Выборка.ИнициаторЗаявки.Должность.Наименование;
	Подвал.Параметры.ФИОИнициатора = Выборка.ИнициаторЗаявки.Наименование;		
	Подвал.Параметры.ТелефонИнициатора = Выборка.ИнициаторЗаявки.РабочийТелефон;		
	Подвал.Параметры.ПочтаИнициатора = Выборка.ИнициаторЗаявки.Эмаил;		


	ТабДок.Вывести(Подвал);
	
КонецПроцедуры
