
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ПрофилиДолжностей") Тогда
		// Заполнение шапки
		ГрафикРаботы = ДанныеЗаполнения.ГрафикРаботы;
		ДоВычетаНалога = ДанныеЗаполнения.ДоВычетаНалога;
		ДолжностныеОбязанности = ДанныеЗаполнения.ДолжностныеОбязанности;
		ВакантнаяДолжность = ДанныеЗаполнения.Должность;
		КатегорияДолжности = ДанныеЗаполнения.КатегорияДолжности;
		Образование = ДанныеЗаполнения.Образование;
		ОплатаТрудаДо = ДанныеЗаполнения.ОплатаТрудаДо;
		ОплатаТрудаОт = ДанныеЗаполнения.ОплатаТрудаОт;
		ОпытРаботы = ДанныеЗаполнения.ОпытРаботы;
		Подразделение = ДанныеЗаполнения.Подразделение;
		ИнициаторЗаявки = ДанныеЗаполнения.РуководительПодразделения;
		ПрофильДолжности = ДанныеЗаполнения.Ссылка;
		ТипЗанятости = ДанныеЗаполнения.ТипЗанятости;
		Требования = ДанныеЗаполнения.Требования;
		Условия = ДанныеЗаполнения.Условия;
		ФорматРаботы = ДанныеЗаполнения.ФорматРаботы;
		Для Каждого ТекСтрокаЗнанияЯзыков Из ДанныеЗаполнения.ЗнанияЯзыков Цикл
			НоваяСтрока = ЗнанияЯзыков.Добавить();
			НоваяСтрока.УровеньВладения = ТекСтрокаЗнанияЯзыков.УровеньВладения;
			НоваяСтрока.Язык = ТекСтрокаЗнанияЯзыков.Язык;
		КонецЦикла;
		Для Каждого ТекСтрокаЛичныеКачества Из ДанныеЗаполнения.ЛичныеКачества Цикл
			НоваяСтрока = ЛичныеКачества.Добавить();
			НоваяСтрока.Качество = ТекСтрокаЛичныеКачества.Качество;
		КонецЦикла;
		Для Каждого ТекСтрокаПрофессиональныеНавыки Из ДанныеЗаполнения.ПрофессиональныеНавыки Цикл
			НоваяСтрока = ПрофессиональныеНавыки.Добавить();
			НоваяСтрока.Навык = ТекСтрокаПрофессиональныеНавыки.Навык;
			НоваяСтрока.УровеньВладения = ТекСтрокаПрофессиональныеНавыки.УровеньВладения;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
