
Процедура ВывестиСообщение(ТекстСообщения, Поле = "") Экспорт

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Если НЕ ПустаяСтрока(Поле) Тогда
		Сообщение.Поле = Поле;
	КонецЕсли;
	Сообщение.Сообщить();
	
КонецПроцедуры

Функция ЗаписатьЗначениеВJSON(Значение) Экспорт

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();	
	ЗаписатьJSON(ЗаписьJSON, Значение);		
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;

КонецФункции

Функция ПрочитатьЗначениеИзJSON(СтрокаJSON, ПрочитатьВСоответствие = Ложь) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	ОтветJSON = ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие); 
	ЧтениеJSON.Закрыть();
	
	Возврат ОтветJSON;
	
КонецФункции