
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ФильтрСКД = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ПолеОтбора = Новый ПолеКомпоновкиДанных("Подразделение");
	ФильтрСКД.ЛевоеЗначение = ПолеОтбора;
	ФильтрСКД.Использование = Истина;
	ФильтрСКД.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ФильтрСКД.ПравоеЗначение = ПолучитьПодразделениеТекПользователя(); 
		
КонецПроцедуры

Функция ПолучитьПодразделениеТекПользователя()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Сотрудник.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.ТекущийПользователь);	
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();	
	Выборка.Следующий();

	Возврат Выборка.Подразделение;

КонецФункции