
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() Тогда 
		Если ЭтотОбъект.Параметры.ЗначенияЗаполнения.Свойство("ДополнительнаяИнформацияОСебе") Тогда
			ТекстОСебе.Добавить(ЭтотОбъект.Параметры.ЗначенияЗаполнения.ДополнительнаяИнформацияОСебе);	
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ДанныеФотографии = РегистрыСведений.ФотографииКандидатов.СоздатьМенеджерЗаписи();
	ДанныеФотографии.Кандидат = Объект.Ссылка;
	ДанныеФотографии.Прочитать();
	
	Если ДанныеФотографии.Выбран() Тогда
		Объект.ФотоКандидата = ПоместитьВоВременноеХранилище(ДанныеФотографии.Фотография.Получить());
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ТекстОСебе = ТекущийОбъект.ХранилищеТекстаОКандидате.Получить();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ХранилищеТекстаОКандидате = Новый ХранилищеЗначения(ТекстОСебе);	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
		
	Если ЭтоАдресВременногоХранилища(Объект.ФотоКандидата) Тогда
		ЗаписьОФотографии = РегистрыСведений.ФотографииКандидатов.СоздатьМенеджерЗаписи();
		ЗаписьОФотографии.Кандидат = Объект.Ссылка; 		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(Объект.ФотоКандидата);
		ЗаписьОФотографии.Фотография = Новый ХранилищеЗначения(ДвоичныеДанные); 
		ЗаписьОФотографии.Записать();
	КонецЕсли;  
	
	Если Объект.ФотоКандидата = "УдалитьФото" Тогда
		УдалитьФотографиюИзРегистра(Объект.Ссылка); 
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ФотоКандидатаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ВыбратьФотоКандидата();	
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьФотоКандидата()
		
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов();
	ПараметрыДиалога.Заголовок = "Выберите фотографию кандидата";
	ПараметрыДиалога.Фильтр = "Фотография | *.png; *.jpg; *.jpeg; *.bmp";
	
	Результат = Ждать ПоместитьФайлНаСерверАсинх(,,, ПараметрыДиалога, УникальныйИдентификатор); 
	
	Если Результат <> Неопределено Тогда		
		Объект.ФотоКандидата = Результат.Адрес;
		Модифицированность = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФотографию(Команда)
		
	Объект.ФотоКандидата = "УдалитьФото";
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьФотографиюИзРегистра(Кандидат)

	ДанныеФотографии = РегистрыСведений.ФотографииКандидатов.СоздатьМенеджерЗаписи();
	ДанныеФотографии.Кандидат = Кандидат;
	ДанныеФотографии.Прочитать();
	
	Если ДанныеФотографии.Выбран() Тогда
		ДанныеФотографии.Удалить();		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Асинх Процедура ОткрытьРезюмеВБраузере(Команда)
	
	ОчиститьСообщения();
		
	Если ПустаяСтрока(Объект.СсылкаНаРезюме) Тогда
		ОбщегоНазначенияКлиент.ВывестиСообщение("Ссылка не найдена. Кандидат был добавлен не из обработки ""Поиск и просмотр резюме HeadHunter""");
		Возврат;
	КонецЕсли;
		
	Ждать ЗапуститьПриложениеАсинх(Объект.СсылкаНаРезюме);	
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура СкачатьРезюме(Команда)
	
	ОчиститьСообщения();
		
	СсылкаНаРезюме = Объект.СсылкаНаСкачиваниеРезюмеХХ;
	
	Если ПустаяСтрока(СсылкаНаРезюме) Тогда
		ОбщегоНазначенияКлиент.ВывестиСообщение("Не найдена ссылка на скачивание резюме. Кандидат был добавлен не из обработки ""Поиск и просмотр резюме HeadHunter""");
		Возврат;
	КонецЕсли;
	
	СсылкаНаРезюме = Сред(СсылкаНаРезюме, 18);	
	ДанныеПриложения = ПолучитьДанныеПриложения();
	
	Если ПустаяСтрока(ДанныеПриложения.ТокенПользователя) Тогда
		ОбщегоНазначенияКлиент.ВывестиСообщение("Получите токен");
		Возврат;
	КонецЕсли;
	
	HTTPСоединение = Новый HTTPСоединение("api.hh.ru", 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());
	HTTPЗапрос = Новый HTTPЗапрос(СсылкаНаРезюме);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/pdf");
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Bearer " + ДанныеПриложения.ТокенПользователя);
	HTTPЗапрос.Заголовки.Вставить("User-Agent", ДанныеПриложения.НазваниеПриложения + " (" + ДанныеПриложения.ПочтаРазработчика + ")");
	
	Попытка
		HTTPОтвет = Ждать HTTPСоединение.ПолучитьАсинх(HTTPЗапрос);
		
		Если HTTPОтвет.КодСостояния <> 200 Тогда
			Возврат;
		КонецЕсли;
		
		ФайлПДФ = HTTPОтвет.ПолучитьТелоКакДвоичныеДанные();
		
		Режим = РежимДиалогаВыбораФайла.Сохранение; 
		ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(Режим);              
		ДиалогСохраненияФайла.ПолноеИмяФайла = Лев(Строка(Объект.СсылкаНаВакансию), 19) + Объект.ЖелаемаяДолжность + "(" + Формат(Объект.ДатаСозданияРезюме, "ДЛФ=ДД") + "-" + Формат(Объект.ДатаПоследнегоОбновленияРезюме, "ДЛФ=ДД") + ")" + ".pdf"; 
		ДиалогСохраненияФайла.МножественныйВыбор = Ложь; 
		ДиалогСохраненияФайла.Заголовок = "Выберите место сохранения резюме";
		
		МестоСохранения = Ждать ДиалогСохраненияФайла.ВыбратьАсинх();	
		Если МестоСохранения = Неопределено Тогда;
			Возврат;
		КонецЕсли;   
		
		ОтветПользователя = Ждать ВопросАсинх("Сохранить резюме в регистре с файлами кандидатов?", РежимДиалогаВопрос.ДаНет,,, "Сохранить резюме в регистре"); 
		
		Если ОтветПользователя = КодВозвратаДиалога.Да Тогда
			НазваниеФайла = Лев(Строка(Объект.СсылкаНаВакансию), 19) + Объект.ЖелаемаяДолжность + "(" + Формат(Объект.ДатаСозданияРезюме, "ДЛФ=ДД") + "-" + Формат(Объект.ДатаПоследнегоОбновленияРезюме, "ДЛФ=ДД") + ")";
			ЗаписатьФайлПДФВРегистр(ФайлПДФ, Объект.Ссылка, НазваниеФайла);	
		КонецЕсли;
		
		ПолныйПутьКФайлу = МестоСохранения[0];
		
		ЗаписьДанных = Новый ЗаписьДанных(ПолныйПутьКФайлу);
		Ждать ЗаписьДанных.ЗаписатьАсинх(ФайлПДФ);
		Ждать ЗаписьДанных.ЗакрытьАсинх(); 
		
		ОтветПользователя = Ждать ВопросАсинх("Открыть резюме после скачивания?", РежимДиалогаВопрос.ДаНет,,, "Открыть резюме"); 
		
		Если ОтветПользователя = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		
		ДокументPDF = Новый ДокументPDF();
		Ждать ДокументPDF.ПрочитатьАсинх(ПолныйПутьКФайлу);
		ДокументPDF.Показать("Резюме кандидата - " + Объект.ЖелаемаяДолжность);
		
	Исключение
		ОбщегоНазначенияКлиент.ВывестиСообщение(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПриложения() 
	
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Если ТекПользователь.ИспользоватьСвоеПриложение Тогда
		ТипИспользуемогоПриложения = Перечисления.ТипыПриложенияХХ.Личное;
		НазваниеПриложения = ТекПользователь.НазваниеПриложенияХХ;
		ПочтаРазработчика = ТекПользователь.ПочтаРазработчикаХХ;;	
	Иначе
		ТипИспользуемогоПриложения = Перечисления.ТипыПриложенияХХ.Общее;
		НазваниеПриложения = Константы.НазваниеПриложенияХХ.Получить();
		ПочтаРазработчика = Константы.ПочтаРазработчикаХХ.Получить();
	КонецЕсли;

	ОтборПользователя = Новый Структура("Пользователь, ТипПриложения", ТекПользователь, ТипИспользуемогоПриложения);
	ТокенПользователя = РегистрыСведений.ТокеныПользователей.Получить(ОтборПользователя).Токен;
		
	ДанныеПриложения = Новый Структура;
	ДанныеПриложения.Вставить("ТокенПользователя", ТокенПользователя);
	ДанныеПриложения.Вставить("НазваниеПриложения", НазваниеПриложения);
	ДанныеПриложения.Вставить("ПочтаРазработчика", ПочтаРазработчика);
	        
	Возврат ДанныеПриложения;

КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьФайлПДФВРегистр(ДвоичныеДанные, Кандидат, ИмяФайла)

	НоваяЗапись = РегистрыСведений.ФайлыКандидатов.СоздатьМенеджерЗаписи();
	НоваяЗапись.Кандидат = Кандидат;
	НоваяЗапись.Наименование = ИмяФайла;
	НоваяЗапись.ИмяФайлаБезРасширения = ИмяФайла;
	НоваяЗапись.РасширениеФайла = ".pdf";
	
	РазмерФайлаВБайтах = ДвоичныеДанные.Размер();
	РазмерФайлаВКилобайтах = Окр(РазмерФайлаВБайтах / 1024, 1); 
	НоваяЗапись.РазмерФайла = РазмерФайлаВКилобайтах;
	
	НоваяЗапись.ФайлКандидата = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
	НоваяЗапись.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ГородПриИзменении(Элемент)
	
	Объект.Регион = ПолучитьРегионГорода(Объект.Город);		
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьРегионГорода(Город)

	Возврат Город.Родитель.Наименование;	

КонецФункции

&НаКлиенте
Процедура СсылкаНаВакансиюПриИзменении(Элемент)
	
	Объект.НаименованиеВакансии = ПолучитьНаименованиеВакансии(Объект.СсылкаНаВакансию);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНаименованиеВакансии(Вакансия)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Вакансия.НаименованиеВакансии КАК НаименованиеВакансии
		|ИЗ
		|	Документ.Вакансия КАК Вакансия
		|ГДЕ
		|	Вакансия.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Вакансия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();	
	Выборка.Следующий();

	Возврат Выборка.НаименованиеВакансии;	

КонецФункции


