
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеФотографии = РегистрыСведений.ФотографииКандидатов.СоздатьМенеджерЗаписи();
	ДанныеФотографии.Кандидат = Объект.Ссылка;
	ДанныеФотографии.Прочитать();
	
	Если ДанныеФотографии.Выбран() Тогда
		Объект.ФотоКандидата = ПоместитьВоВременноеХранилище(ДанныеФотографии.Фотография.Получить());		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(Объект.ФотоКандидата) Тогда
		ЗаписьОФотографии = РегистрыСведений.ФотографииКандидатов.СоздатьМенеджерЗаписи();
		ЗаписьОФотографии.Кандидат = Объект.Ссылка; 		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(Объект.ФотоКандидата);
		ЗаписьОФотографии.Фотография = Новый ХранилищеЗначения(ДвоичныеДанные); 
		ЗаписьОФотографии.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФотоКандидатаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыбратьФотоКандидата();
	
	
КонецПроцедуры


&НаКлиенте
Асинх Процедура ВыбратьФотоКандидата()
		
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов();
	ПараметрыДиалога.Заголовок = "Выберите фотографию кандидата";
	ПараметрыДиалога.Фильтр = "Фотография | *.png; *.jpg; *.jpeg; *.bmp";
	
	Результат = Ждать ПоместитьФайлНаСерверАсинх(,,, ПараметрыДиалога, УникальныйИдентификатор); 
	
	Если Результат <> Неопределено Тогда		
		Объект.ФотоКандидата = Результат.Адрес;
		Модифицированность = Истина;
	КонецЕсли;
		
КонецПроцедуры
