
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда	
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
		Объект.ОтветственныйЗаВакансию = ТекущийПользователь.Сотрудник;
		Объект.АвторДокумента = ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ТекстВакансии = ТекущийОбъект.ХранилищеФорматированногоТекста.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ХранилищеФорматированногоТекста = Новый ХранилищеЗначения(ТекстВакансии);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗаполнитьТекстВакансииИзПрофиля(Команда)
	
	ТекстВопроса = "Текст вакансии будет заполнен из профиля должности. Текущий текст вакансии будет удален. Продолжить?"; 
	Кнопки = РежимДиалогаВопрос.ДаНет; 
	ЗаголовокВопроса = "Текст вакансии будет заполнен по данным профиля должности";
	
	ОтветПользователя = Ждать ВопросАсинх(ТекстВопроса, Кнопки,,, ЗаголовокВопроса);
	
	Если ОтветПользователя = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПрофиляДолжности = ПолучитьДанныеПрофиляДолжности(Объект.ПрофильДолжности);
	    
	ТекстВакансии = "";
		
	ШрифтЗаголовков = Новый Шрифт(, 12, Истина);
	
	// Добавление обязанностей
	ЗаголовокОбязанности = ТекстВакансии.Добавить("Обязанности:" + Символы.ПС);		
	ЗаголовокОбязанности.Шрифт = ШрифтЗаголовков;	
	
	ТекстВакансии.Добавить(ДанныеПрофиляДолжности.Обязанности + Символы.ПС); 
	
	// Добавление требований
	ЗаголовокТребований = ТекстВакансии.Добавить("Требования:" + Символы.ПС);		
	ЗаголовокТребований.Шрифт = ШрифтЗаголовков;
	
	ТребованияНачало = ДанныеПрофиляДолжности.Образование + Символы.ПС + ДанныеПрофиляДолжности.ОпытРаботы + Символы.ПС; 	
	ТекстВакансии.Добавить(ТребованияНачало + ДанныеПрофиляДолжности.Требования + Символы.ПС);
	
	// Добавление условий
	ЗаголовокУсловий = ТекстВакансии.Добавить("Условия:" + Символы.ПС);		
	ЗаголовокУсловий.Шрифт = ШрифтЗаголовков;
	
	УсловияНачало = ДанныеПрофиляДолжности.ТипЗанятости + Символы.ПС + ДанныеПрофиляДолжности.ГрафикРаботы + Символы.ПС 
														+ ДанныеПрофиляДолжности.ФорматРаботы + Символы.ПС;
	
	ОплатаОт = ДанныеПрофиляДолжности.ОплатаТрудаОт;
	ОплатаДо = ДанныеПрофиляДолжности.ОплатаТрудаДо;
	ДоВычета = ДанныеПрофиляДолжности.ДоВычетаНалога;
	
	УсловияОплаты = "";
	
	Если ОплатаОт = 0 И ОплатаДо <> 0 Тогда
		УсловияОплаты = УсловияОплаты + "Оплата труда до: " + ОплатаДо + " рублей в месяц";
	ИначеЕсли ОплатаОт <> 0 И ОплатаДо = 0 Тогда
		УсловияОплаты = УсловияОплаты + "Оплата труда от: " + ОплатаОт + " рублей в месяц";
	ИначеЕсли ОплатаОт <> 0 И ОплатаДо <> 0 Тогда 
		УсловияОплаты = УсловияОплаты + "Оплата труда от: " + ОплатаОт + " до: " + ОплатаДо + " рублей в месяц";
	КонецЕсли;
	
	Если ДоВычета И (ОплатаОт <> 0 ИЛИ ОплатаДо <> 0) Тогда
		УсловияОплаты = УсловияОплаты + " (до вычета налога)" + Символы.ПС;
	ИначеЕсли НЕ ДоВычета И (ОплатаОт <> 0 ИЛИ ОплатаДо <> 0) Тогда 
		УсловияОплаты = УсловияОплаты + Символы.ПС;
	КонецЕсли;
	
	ТекстВакансии.Добавить(УсловияНачало + УсловияОплаты + ДанныеПрофиляДолжности.Условия + Символы.ПС);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПрофиляДолжности(ПрофильДолжности)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрофилиДолжностей.ДолжностныеОбязанности КАК ДолжностныеОбязанности,
		|	ПрофилиДолжностей.Требования КАК Требования,
		|	ПрофилиДолжностей.Условия КАК Условия,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПрофилиДолжностей.Образование) КАК Образование,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПрофилиДолжностей.ОпытРаботы) КАК ОпытРаботы,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПрофилиДолжностей.ТипЗанятости) КАК ТипЗанятости,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПрофилиДолжностей.ГрафикРаботы) КАК ГрафикРаботы,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПрофилиДолжностей.ФорматРаботы) КАК ФорматРаботы,
		|	ПРЕДСТАВЛЕНИЕ(ПрофилиДолжностей.ОплатаТрудаОт) КАК ОплатаТрудаОт,
		|	ПРЕДСТАВЛЕНИЕ(ПрофилиДолжностей.ОплатаТрудаДо) КАК ОплатаТрудаДо,
		|	ПрофилиДолжностей.ДоВычетаНалога КАК ДоВычетаНалога
		|ИЗ
		|	Справочник.ПрофилиДолжностей КАК ПрофилиДолжностей
		|ГДЕ
		|	ПрофилиДолжностей.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ПрофильДолжности);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ДанныеПрофиляДолжности = Новый Структура;
	ДанныеПрофиляДолжности.Вставить("Обязанности", Выборка.ДолжностныеОбязанности);
	ДанныеПрофиляДолжности.Вставить("Требования", Выборка.Требования);
    ДанныеПрофиляДолжности.Вставить("Условия", Выборка.Условия);
    ДанныеПрофиляДолжности.Вставить("Образование", "Образование: " +Выборка.Образование);
	ДанныеПрофиляДолжности.Вставить("ОпытРаботы", "Опыт работы: " +Выборка.ОпытРаботы);
	ДанныеПрофиляДолжности.Вставить("ТипЗанятости", "Тип занятости: " +Выборка.ТипЗанятости);
	ДанныеПрофиляДолжности.Вставить("ГрафикРаботы", "график работы: " +Выборка.ГрафикРаботы);
	ДанныеПрофиляДолжности.Вставить("ФорматРаботы", "Формат работы: " + Выборка.ФорматРаботы);
	ДанныеПрофиляДолжности.Вставить("ОплатаТрудаОт", Выборка.ОплатаТрудаОт);
	ДанныеПрофиляДолжности.Вставить("ОплатаТрудаДо", Выборка.ОплатаТрудаДо);
	ДанныеПрофиляДолжности.Вставить("ДоВычетаНалога", Выборка.ДоВычетаНалога);
	
	Возврат ДанныеПрофиляДолжности;
	
КонецФункции

&НаКлиенте
Процедура РазместитьНаСайтеУниверситета(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура РазместитьНаСайтеХХ(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры
