
// Используется в отчете
Функция ПолучитьТекущегоСотрудника() Экспорт
		
	ТекСотрудник = СтрРазделить(СокрЛП(ПараметрыСеанса.ТекущийПользователь.Сотрудник.Наименование), " ");	
	ФИО = "";
	Для Шаг = 0 По ТекСотрудник.ВГраница() Цикл
		Если Шаг = 0 Тогда
			ФИО = ФИО + ТекСотрудник[Шаг] + " ";
		ИначеЕсли Шаг = 1 Тогда
			ФИО = ФИО + Лев(ТекСотрудник[Шаг], 1) + ". ";
		ИначеЕсли Шаг = 2 Тогда
			ФИО = ФИО + Лев(ТекСотрудник[Шаг], 1) + ".";
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ФИО;
	
КонецФункции

Функция ПолучитьПодразделениеТекПользователя(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Сотрудник.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Пользователь);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();	
	Выборка.Следующий();
	
	Возврат Выборка.Подразделение;

КонецФункции
