
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьОбязанности();	
	ЗаполнитьТребования();
	ЗаполнитьУсловия();
	
КонецПроцедуры

&НаКлиенте
Процедура ДолжностныеОбязанностиПриИзменении(Элемент)
	ЗаполнитьОбязанности();
КонецПроцедуры

&НаКлиенте
Процедура ТребованияПриИзменении(Элемент)
	ЗаполнитьТребования();
КонецПроцедуры

&НаКлиенте
Процедура ОбразованиеПриИзменении(Элемент)
	ЗаполнитьТребования();	
КонецПроцедуры

&НаКлиенте
Процедура ОпытРаботыПриИзменении(Элемент)
	ЗаполнитьТребования();
КонецПроцедуры

&НаКлиенте
Процедура УсловияПриИзменении(Элемент)
	ЗаполнитьУсловия();
КонецПроцедуры

&НаКлиенте
Процедура ТипЗанятостиПриИзменении(Элемент)
	ЗаполнитьУсловия();
КонецПроцедуры

&НаКлиенте
Процедура ГрафикРаботыПриИзменении(Элемент)
	ЗаполнитьУсловия();
КонецПроцедуры

&НаКлиенте
Процедура ФорматРаботыПриИзменении(Элемент)
	ЗаполнитьУсловия();
КонецПроцедуры

&НаКлиенте
Процедура ОплатаТрудаОтПриИзменении(Элемент)
	ЗаполнитьУсловия();
КонецПроцедуры

&НаКлиенте
Процедура ОплатаТрудаДоПриИзменении(Элемент)
	ЗаполнитьУсловия();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОбязанности()
	
	Если НЕ ПустаяСтрока(Объект.ДолжностныеОбязанности) Тогда
		Элементы.ДекорацияТекстОбязанности.Заголовок = Объект.ДолжностныеОбязанности;
	Иначе
		Элементы.ДекорацияТекстОбязанности.Заголовок = "Обязанности не указаны";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТребования()
	
	Если ПустаяСтрока(Объект.Требования) И Объект.Образование.Пустая() И Объект.ОпытРаботы.Пустая() Тогда
		Элементы.ДекорацияТекстТребования.Заголовок = "Требования не указаны";
		Возврат;
	КонецЕсли; 
	
	ЗаголовокДекорации = "";
	
	Если НЕ Объект.Образование.Пустая() Тогда
		ЗаголовокДекорации = ЗаголовокДекорации + "Образование: " + Объект.Образование + Символы.ПС; 
	КонецЕсли;
	
	Если НЕ Объект.ОпытРаботы.Пустая() Тогда
		ЗаголовокДекорации = ЗаголовокДекорации + "Опыт работы: " + Объект.ОпытРаботы + Символы.ПС; 
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Объект.Требования) Тогда
		ЗаголовокДекорации = ЗаголовокДекорации + Объект.Требования; 
	КонецЕсли;
	
	Элементы.ДекорацияТекстТребования.Заголовок = ЗаголовокДекорации;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУсловия()
	
	Если ПустаяСтрока(Объект.Условия) И Объект.ТипЗанятости.Пустая() И Объект.ФорматРаботы.Пустая() И Объект.ГрафикРаботы.Пустая() И Объект.ОплатаТрудаОт = 0 И Объект.ОплатаТрудаДо = 0 Тогда
		Элементы.ДекорацияТекстУсловия.Заголовок = "Условия не указаны";
		Возврат;
	КонецЕсли;
	
	ЗаголовокДекорации = "";
		
	Если НЕ Объект.ТипЗанятости.Пустая() Тогда
		ЗаголовокДекорации = ЗаголовокДекорации + "Тип занятости: " + Объект.ТипЗанятости + Символы.ПС; 
	КонецЕсли;
	
	Если НЕ Объект.ГрафикРаботы.Пустая() Тогда
		ЗаголовокДекорации = ЗаголовокДекорации + "График работы: " + Объект.ГрафикРаботы + Символы.ПС; 
	КонецЕсли;
	
	Если НЕ Объект.ФорматРаботы.Пустая() Тогда
		ЗаголовокДекорации = ЗаголовокДекорации + "Формат работы: " + Объект.ФорматРаботы + Символы.ПС; 
	КонецЕсли;
	
	Если Объект.ОплатаТрудаОт = 0 И Объект.ОплатаТрудаДо <> 0 Тогда
		ЗаголовокДекорации = ЗаголовокДекорации + "Оплата труда до: "  + Объект.ОплатаТрудаДо + " рублей в месяц" + Символы.ПС;
	ИначеЕсли Объект.ОплатаТрудаОт <> 0 И Объект.ОплатаТрудаДо = 0 Тогда
		ЗаголовокДекорации = ЗаголовокДекорации + "Оплата труда от: "  + Объект.ОплатаТрудаОт + " рублей в месяц" + Символы.ПС;
	ИначеЕсли Объект.ОплатаТрудаОт <> 0 И Объект.ОплатаТрудаДо <> 0 Тогда 
		ЗаголовокДекорации = ЗаголовокДекорации + "Оплата труда от: "  + Объект.ОплатаТрудаОт + " до: " + Объект.ОплатаТрудаДо + " рублей в месяц" + Символы.ПС;
	КонецЕсли; 
			
	Если НЕ ПустаяСтрока(Объект.Условия) Тогда
		ЗаголовокДекорации = ЗаголовокДекорации + Объект.Условия; 
	КонецЕсли;
	
	Элементы.ДекорацияТекстУсловия.Заголовок = ЗаголовокДекорации; 	

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзПрофиляДолжности(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры



