
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьОбязанностиУсловияТребования();
	
КонецПроцедуры

&НаКлиенте
Процедура ДолжностныеОбязанностиПриИзменении(Элемент)
	Элементы.ДекорацияТекстОбязанности.Заголовок = Объект.ДолжностныеОбязанности;
КонецПроцедуры

&НаКлиенте
Процедура ТребованияПриИзменении(Элемент)
	Элементы.ДекорацияТекстТребования.Заголовок = Объект.Требования;
КонецПроцедуры

&НаКлиенте
Процедура УсловияПриИзменении(Элемент)
	Элементы.ДекорацияТекстУсловия.Заголовок = Объект.Условия;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОбязанностиУсловияТребования()

	Элементы.ДекорацияТекстОбязанности.Заголовок = Объект.ДолжностныеОбязанности;
	Элементы.ДекорацияТекстТребования.Заголовок = Объект.Требования;
	Элементы.ДекорацияТекстУсловия.Заголовок = Объект.Условия;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзПрофиляДолжности(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

