
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СогласованиеЗаявки") Тогда
		ЗаявкаНаПодбор = ДанныеЗаполнения.Заявка; 
		ДокументОснование = ДанныеЗаполнения;
		ПланируемаяДатаЗакрытия = ЗаявкаНаПодбор.ПланируемыйСрокЗакрытия;
		ПриоритетПоиска = ЗаявкаНаПодбор.ПриоритетПоиска;
		Подразделение = ЗаявкаНаПодбор.Подразделение;
		Должность = ЗаявкаНаПодбор.ВакантнаяДолжность;
		ПрофильДолжности = ЗаявкаНаПодбор.ПрофильДолжности;
		Образование = ЗаявкаНаПодбор.Образование;
		ОпытРаботы = ЗаявкаНаПодбор.ОпытРаботы; 
		ТипЗанятости = ЗаявкаНаПодбор.ТипЗанятости;
		ГрафикРаботы = ЗаявкаНаПодбор.ГрафикРаботы; 
		ФорматРаботы = ЗаявкаНаПодбор.ФорматРаботы;
		ОплатаТрудаОт = ЗаявкаНаПодбор.ОплатаТрудаОт;
		ОплатаТрудаДо = ЗаявкаНаПодбор.ОплатаТрудаДо;
		ДоВычетаНалога = ЗаявкаНаПодбор.ДоВычетаНалога;
						
		КлючевыеНавыки.Загрузить(ЗаявкаНаПодбор.КлючевыеНавыки.Выгрузить());
		ЛичныеКачества.Загрузить(ЗаявкаНаПодбор.ЛичныеКачества.Выгрузить());
		ЗнанияЯзыков.Загрузить(ЗаявкаНаПодбор.ЗнанияЯзыков.Выгрузить());				
	КонецЕсли;

КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр накопления ДвиженияВакансий 
	Движения.ДвиженияВакансий.Записывать = Истина;
	Движение = Движения.ДвиженияВакансий.Добавить();
	Движение.Период = Дата;
	Движение.СтатусВакансии = СтатусВакансии;
	Движение.ПриоритетПоиска = ПриоритетПоиска;
	Движение.ПланируемаяДатаЗакрытия = ПланируемаяДатаЗакрытия;
	Движение.Подразделение = Подразделение;
	Движение.Должность = Должность;
	Движение.РазмещениеВакансииНаСайте = ВакансияРазмещенаНаСайте;
	Движение.ЗаработнаяПлатаОт = ОплатаТрудаОт;
	Движение.ЗаработнаяПлатаДо = ОплатаТрудаДо;
	Движение.Количество = 1;
	
КонецПроцедуры



