
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СогласованиеЗаявки") Тогда
		ЗаявкаНаПодбор = ДанныеЗаполнения.Заявка; 
		ДокументОснование = ДанныеЗаполнения;
		ПланируемаяДатаЗакрытия = ЗаявкаНаПодбор.ПланируемыйСрокЗакрытия;
		Подразделение = ЗаявкаНаПодбор.Подразделение;
		Должность = ЗаявкаНаПодбор.ВакантнаяДолжность;
		ПрофильДолжности = ЗаявкаНаПодбор.ПрофильДолжности;
		Образование = ЗаявкаНаПодбор.Образование;
		ОпытРаботы = ЗаявкаНаПодбор.ОпытРаботы; 
		ТипЗанятости = ЗаявкаНаПодбор.ТипЗанятости;
		ГрафикРаботы = ЗаявкаНаПодбор.ГрафикРаботы; 
		ФорматРаботы = ЗаявкаНаПодбор.ФорматРаботы;
		ОплатаТрудаОт = ЗаявкаНаПодбор.ОплатаТрудаОт;
		ОплатаТрудаДо = ЗаявкаНаПодбор.ОплатаТрудаДо;
		ДоВычетаНалога = ЗаявкаНаПодбор.ДоВычетаНалога;
						
		ПрофессиональныеНавыки.Загрузить(ЗаявкаНаПодбор.ПрофессиональныеНавыки.Выгрузить());
		ЛичныеКачества.Загрузить(ЗаявкаНаПодбор.ЛичныеКачества.Выгрузить());
		ЗнанияЯзыков.Загрузить(ЗаявкаНаПодбор.ЗнанияЯзыков.Выгрузить());				
	КонецЕсли;

КонецПроцедуры 



