
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ИнициаторЗаявки = ПолучитьТекСотрудника();	
	КонецЕсли;
	
	ЭлементОтбора = Кандидаты.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Вакансия");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Объект.Вакансия;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбновитьКартуМаршрута();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьКартуМаршрута();
	Если Объект.Стартован Тогда
		ОповеститьОбИзменении(Тип("ЗадачаСсылка.ЗадачаПодборПерсонала"));	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекСотрудника()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Сотрудник.Ссылка КАК Сотрудник
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.ТекущийПользователь);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();	
	Выборка.Следующий();

	Возврат Выборка.Сотрудник;
		
КонецФункции

&НаСервере
Процедура ОбновитьКартуМаршрута()

	БизнесПроцессОбъект = РеквизитФормыВЗначение("Объект");
	КартаМаршрута = БизнесПроцессОбъект.ПолучитьКартуМаршрута(); 	

КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаПодборНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура("ИнициаторЗаявки", ПолучитьТекСотрудника());
	ПараметрыОтбора = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("Документ.ЗаявкаНаПодбор.ФормаВыбора", ПараметрыОтбора, Элемент); 
	
КонецПроцедуры

&НаКлиенте
Процедура СогласованиеЗаявкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура("ИнициаторЗаявки", ПолучитьТекСотрудника());
	Отбор.Вставить("Заявка", Объект.ЗаявкаНаПодбор);
	ПараметрыОтбора = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("Документ.СогласованиеЗаявки.ФормаВыбора", ПараметрыОтбора, Элемент); 	
	
КонецПроцедуры

&НаКлиенте
Процедура СогласованиеЗаявкиСоздание(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Основание", Объект.ЗаявкаНаПодбор);
	ОткрытьФорму("Документ.СогласованиеЗаявки.Форма.ФормаДокумента", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВакансияСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Основание", Объект.СогласованиеЗаявки);
	ОткрытьФорму("Документ.Вакансия.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВакансияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура("ДокументОснование", Объект.СогласованиеЗаявки);	
	ПараметрыОтбора = Новый Структура("Отбор", Отбор);	
	ОткрытьФорму("Документ.Вакансия.ФормаВыбора", ПараметрыОтбора, Элемент); 		
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияКандидатовСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Основание", Объект.Вакансия);
	ОткрытьФорму("Документ.РегистрацияКандидатов.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ Объект.РегистрацияКандидатов.Пустая() И Объект.НайденыПодходящиеКандидаты.Пустая() Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиент.ВывестиСообщение("Заполните реквизит ""Найдены подходящие кандидаты""", "Объект.НайденыПодходящиеКандидаты");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеВакансииСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Основание", Объект.Вакансия);
	ОткрытьФорму("Документ.ЗакрытиеВакансии.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеВакансииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура("Вакансия", Объект.Вакансия);	
	ПараметрыОтбора = Новый Структура("Отбор", Отбор);	
	ОткрытьФорму("Документ.ЗакрытиеВакансии.ФормаВыбора", ПараметрыОтбора, Элемент); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыНаВакансиюСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Основание", Объект.Вакансия);
	ОткрытьФорму("Документ.ЗатратыНаВакансию.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыНаВакансиюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура("Вакансия", Объект.Вакансия);	
	ПараметрыОтбора = Новый Структура("Отбор", Отбор);	
	ОткрытьФорму("Документ.ЗатратыНаВакансию.ФормаВыбора", ПараметрыОтбора, Элемент); 
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСобеседование(Команда)
	
	ОчиститьСообщения();
	
	Если Объект.Вакансия.Пустая() Тогда
		ОбщегоНазначенияКлиент.ВывестиСообщение("Вакансия не выбрана", "Объект.Вакансия");
		Возврат;
	КонецЕсли;
		
	ЗначенияЗаполнения = Новый Структура("Вакансия", Объект.Вакансия);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.ПроведениеСобеседования.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьДанныеКандидата(Команда)
	
	Если ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтрока = ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.Кандидат;
	
	ПараметрыФормы = Новый Структура("Ключ", ТекСтрока);
	ОткрытьФорму("Справочник.Кандидаты.Форма.ФормаЭлемента", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаПодборПриИзменении(Элемент)
	
	Объект.КоличествоЧеловек = ПолучитьКоличествоЧеловек(Объект.ЗаявкаНаПодбор);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКоличествоЧеловек(Заявка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаПодбор.КоличествоЧеловек КАК КоличествоЧеловек
		|ИЗ
		|	Документ.ЗаявкаНаПодбор КАК ЗаявкаНаПодбор
		|ГДЕ
		|	ЗаявкаНаПодбор.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Заявка);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	Возврат Выборка.КоличествоЧеловек;

КонецФункции






