
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТекущийПользователь = ПолучитьТекущегоПользователя(); 
	
	ПараметрыФормы = Новый Структура("Ключ", ТекущийПользователь);
	//Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("ФормаКлиентскогоПриложения") Тогда
	//	ПараметрыФормы.Вставить("ДополнительныеПараметры", Новый Структура("Обработка", Истина));	
	//КонецЕсли;
	ОткрытьФорму("Справочник.Пользователи.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник); 
		
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущегоПользователя()
	
	Возврат ПараметрыСеанса.ТекущийПользователь;	

КонецФункции
