
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		ДанныеРуководителя = ПолучитьДанныеРуководителя();
		Объект.Подразделение = ДанныеРуководителя.Подразделение;
		Объект.РуководительПодразделения = ДанныеРуководителя.Сотрудник;
		ДобавитьЯзыкПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеРуководителя()

	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Сотрудник КАК Сотрудник,
		|	Пользователи.Сотрудник.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	Возврат Выборка;
	
КонецФункции

&НаСервере
Процедура ДобавитьЯзыкПоУмолчанию()

	СтрокаТЧ = Объект.ЗнанияЯзыков.Добавить();
	СтрокаТЧ.Язык = Справочники.Языки.РусскийЯзык;
	СтрокаТЧ.УровеньВладения = Перечисления.УровниЗнанийЯзыков.Родной;

КонецПроцедуры
