
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПредложенияОРаботе.КандидатОтказался") Тогда
		Элементы.ПричинаОтказа.Видимость = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПредложенияОРаботе.КандидатОтказался") Тогда
		Элементы.ПричинаОтказа.Видимость = Истина;
	Иначе
		Элементы.ПричинаОтказа.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры
