
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОпределениеВидимостиОписанияЗакрытия();
КонецПроцедуры

&НаКлиенте
Процедура ПричинаЗакрытияПриИзменении(Элемент)	
	ОпределениеВидимостиОписанияЗакрытия();		
КонецПроцедуры

&НаКлиенте
Процедура ОпределениеВидимостиОписанияЗакрытия()

	Если Объект.ПричинаЗакрытия = ПредопределенноеЗначение("Перечисление.ПричиныЗакрытияВакансий.ДругаяПричина") Тогда
		Элементы.ОписаниеПричины.Видимость = Истина;
	Иначе
		Элементы.ОписаниеПричины.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры
