
Процедура Печать(ТабДок, Ссылка) Экспорт

	Макет = Документы.ПроведениеСобеседования.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПроведениеСобеседования.ДатаСобеседования КАК ДатаСобеседования,
	|	ПроведениеСобеседования.Кандидат КАК Кандидат,
	|	ПроведениеСобеседования.РезультатСобеседования КАК РезультатСобеседования,
	|	ПроведениеСобеседования.Вакансия.НаименованиеВакансии КАК НаименованиеВакансии,
	|	ПроведениеСобеседования.Вакансия.ДокументОснование.Номер КАК НомерЗаявки,
	|	ПроведениеСобеседования.Кандидат.Возраст КАК Возраст,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПроведениеСобеседования.Вакансия.ОтветственныйЗаПоискКандидатов) КАК ОтветственныйЗаСобеседование,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПроведениеСобеседования.Вакансия.ОтветственныйЗаПоискКандидатов.Должность) КАК Должность,
	|	ПроведениеСобеседования.Вакансия.Образование КАК Образование,
	|	ПроведениеСобеседования.Вакансия.ОпытРаботы КАК ОпытРаботы,
	|	ПроведениеСобеседования.ОписаниеРезультата КАК ОписаниеРезультата
	|ИЗ
	|	Документ.ПроведениеСобеседования КАК ПроведениеСобеседования
	|ГДЕ
	|	ПроведениеСобеседования.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		
		ДанныеДляЗаполнения = ПолучитьДанныеДляЗаполнения(Ссылка[0].Вакансия);
		КлючевыеНавыки = ДанныеДляЗаполнения[0];
		СтрокаНавыков = НРег(СтрСоединить(КлючевыеНавыки, ", "));
		Шапка.Параметры.Навыки = СтрокаНавыков;	
		
		ЗнанияЯзыков = ДанныеДляЗаполнения[2];
		СтрокаЗнанийЯзыков = "";
		Для Каждого ЗнаниеЯзыка Из ЗнанияЯзыков Цикл
			СтрокаЗнанийЯзыков = СтрокаЗнанийЯзыков + ЗнаниеЯзыка.Язык + " (" + ЗнаниеЯзыка.УровеньВладения + ")" + ", "; 
		КонецЦикла;	
		СтрокаЗнанийЯзыков = Лев(СтрокаЗнанийЯзыков, СтрДлина(СтрокаЗнанийЯзыков) - 2);
		Шапка.Параметры.ЗнанияИностранного = СтрокаЗнанийЯзыков;
		
		ЛичныеКачества = ДанныеДляЗаполнения[1];
		СтрокаКачеств = НРег(СтрСоединить(ЛичныеКачества, ", "));
		Шапка.Параметры.Качества = СтрокаКачеств;
		
		Если Выборка.РезультатСобеседования = Перечисления.РезультатыСобеседования.Другое Тогда
			Шапка.Параметры.РезультатСобеседования = Выборка.ОписаниеРезультата;
		КонецЕсли;
		
		
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьДанныеДляЗаполнения(Вакансия)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВакансияКлючевыеНавыки.Навык) КАК Навык
		|ИЗ
		|	Документ.Вакансия.КлючевыеНавыки КАК ВакансияКлючевыеНавыки
		|ГДЕ
		|	ВакансияКлючевыеНавыки.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВакансияЛичныеКачества.Качество) КАК Качество
		|ИЗ
		|	Документ.Вакансия.ЛичныеКачества КАК ВакансияЛичныеКачества
		|ГДЕ
		|	ВакансияЛичныеКачества.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВакансияЗнанияЯзыков.Язык) КАК Язык,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВакансияЗнанияЯзыков.УровеньВладения) КАК УровеньВладения
		|ИЗ
		|	Документ.Вакансия.ЗнанияЯзыков КАК ВакансияЗнанияЯзыков
		|ГДЕ
		|	ВакансияЗнанияЯзыков.Ссылка = &Ссылка
		|	И ВакансияЗнанияЯзыков.Язык <> ЗНАЧЕНИЕ(Справочник.Языки.РусскийЯзык)";
	
	Запрос.УстановитьПараметр("Ссылка", Вакансия);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеДляЗаполнения = Новый Массив;
	
	КлючевыеНавыки = РезультатЗапроса[0].Выбрать();
	СписокНавыков = Новый Массив;
	Пока КлючевыеНавыки.Следующий() Цикл
		СписокНавыков.Добавить(КлючевыеНавыки.Навык);	
	КонецЦикла;
	ДанныеДляЗаполнения.Добавить(СписокНавыков);
	
	ЛичныеКачества = РезультатЗапроса[1].Выбрать();
	СписокКачеств = Новый Массив;
	Пока ЛичныеКачества.Следующий() Цикл
		СписокКачеств.Добавить(ЛичныеКачества.Качество);	
	КонецЦикла;
	ДанныеДляЗаполнения.Добавить(СписокКачеств);
	
	ЗнанияЯзыков = РезультатЗапроса[2].Выбрать();
	СписокЯзыков = Новый Массив;
	Пока ЗнанияЯзыков.Следующий() Цикл
		ДанныеЯзыка = Новый Структура("Язык, УровеньВладения", ЗнанияЯзыков.Язык, ЗнанияЯзыков.УровеньВладения);
		СписокЯзыков.Добавить(ДанныеЯзыка);	
	КонецЦикла;

	ДанныеДляЗаполнения.Добавить(СписокЯзыков);
	
	Возврат ДанныеДляЗаполнения; 

КонецФункции

