
Процедура ОбработкаПроведения(Отказ, Режим)

	Если ТипСобеседования = Перечисления.ТипыСобеседований.ПервичноеСобеседование Тогда
		ЗаписатьРезультатПервичногоСобеседованияВРегистр();	
	ИначеЕсли ТипСобеседования = Перечисления.ТипыСобеседований.СобеседованиеСИнициатором Тогда
		ЗаписатьРезультатСобеседованияСИнициаторомВРегистр();
	КонецЕсли;
	
	ЗаписатьДвиженияСтатусыКандидатов();
	
КонецПроцедуры

Процедура ЗаписатьРезультатПервичногоСобеседованияВРегистр()

	// регистр накопления КоличествоКандидатовПоЭтапам Приход
	Движения.КоличествоКандидатовПоЭтапам.Записывать = Истина;
	Движение = Движения.КоличествоКандидатовПоЭтапам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Вакансия = Вакансия;
	Движение.Кандидат = Кандидат;
	Движение.Этап = Перечисления.ЭтапыПодбора.ПервичноеСобеседование;
	Если СтатусСобеседования = Перечисления.СтатусыСобеседований.Запланировано ИЛИ СтатусСобеседования = Перечисления.СтатусыСобеседований.НеСостоялось Тогда
		Движение.ЭтапПройден = Ложь;
	ИначеЕсли СтатусСобеседования = Перечисления.СтатусыСобеседований.Пройдено Тогда
		Движение.ЭтапПройден = Истина;
	КонецЕсли;
	Движение.ДатаИзмененияЭтапа = Дата;
	Движение.Количество = 1;
	
	// регистр накопления КоличествоКандидатовПоЭтапам Расход
	Движения.КоличествоКандидатовПоЭтапам.Записывать = Истина;
	Движение = Движения.КоличествоКандидатовПоЭтапам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Вакансия = Вакансия;
	Движение.Кандидат = Кандидат;
	Движение.Этап = Перечисления.ЭтапыПодбора.ТелефонноеИнтервью;
	Движение.ЭтапПройден = Истина;
	Движение.ДатаИзмененияЭтапа = Дата;
	Движение.Количество = 1;
	
КонецПроцедуры

Процедура ЗаписатьРезультатСобеседованияСИнициаторомВРегистр()

	// регистр накопления КоличествоКандидатовПоЭтапам Приход
	Движения.КоличествоКандидатовПоЭтапам.Записывать = Истина;
	Движение = Движения.КоличествоКандидатовПоЭтапам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Вакансия = Вакансия;
	Движение.Кандидат = Кандидат;
	Движение.Этап = Перечисления.ЭтапыПодбора.СобеседованиеСИнициатором;
	Если СтатусСобеседования = Перечисления.СтатусыСобеседований.Запланировано ИЛИ СтатусСобеседования = Перечисления.СтатусыСобеседований.НеСостоялось Тогда
		Движение.ЭтапПройден = Ложь;
	ИначеЕсли СтатусСобеседования = Перечисления.СтатусыСобеседований.Пройдено Тогда
		Движение.ЭтапПройден = Истина;
	КонецЕсли;
	Движение.ДатаИзмененияЭтапа = Дата;
	Движение.Количество = 1;
	
	// регистр накопления КоличествоКандидатовПоЭтапам Расход
	Движения.КоличествоКандидатовПоЭтапам.Записывать = Истина;
	Движение = Движения.КоличествоКандидатовПоЭтапам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Вакансия = Вакансия;
	Движение.Кандидат = Кандидат;
	Движение.Этап = Перечисления.ЭтапыПодбора.ПервичноеСобеседование;
	Движение.ЭтапПройден = Истина;
	Движение.ДатаИзмененияЭтапа = Дата;
	Движение.Количество = 1;	

КонецПроцедуры

Процедура ЗаписатьДвиженияСтатусыКандидатов()

	// регистр сведений СтатусыКандидатов
	Движения.СтатусыКандидатов.Записывать = Истина;
	Движение = Движения.СтатусыКандидатов.Добавить();
	Движение.Период = Дата;
	Движение.Вакансия = Вакансия;
	Движение.Кандидат = Кандидат;
	Если СтатусСобеседования = Перечисления.СтатусыСобеседований.Запланировано ИЛИ СтатусСобеседования = Перечисления.СтатусыСобеседований.НеСостоялось Тогда
		Движение.ЭтапПройден = Ложь;
	ИначеЕсли СтатусСобеседования = Перечисления.СтатусыСобеседований.Пройдено Тогда
		Движение.ЭтапПройден = Истина;
	КонецЕсли;
	Если ТипСобеседования = Перечисления.ТипыСобеседований.ПервичноеСобеседование Тогда 
		Движение.Статус = Перечисления.ЭтапыПодбора.ПервичноеСобеседование;	
	ИначеЕсли ТипСобеседования = Перечисления.ТипыСобеседований.СобеседованиеСИнициатором Тогда
		Движение.Статус = Перечисления.ЭтапыПодбора.СобеседованиеСИнициатором;
	КонецЕсли;
	
КонецПроцедуры

