
Процедура ОбработкаПроведения(Отказ, Режим)

	Если ТипСобеседования = Перечисления.ТипыСобеседований.ПервичноеСобеседование Тогда
		ЗаписатьРезультатПервичногоСобеседованияВРегистр();
	ИначеЕсли ТипСобеседования = Перечисления.ТипыСобеседований.СобеседованиеСИнициатором Тогда
		ЗаписатьРезультатСобеседованияСИнициаторомВРегистр();
	КонецЕсли;

КонецПроцедуры

Процедура ЗаписатьРезультатПервичногоСобеседованияВРегистр()

	// регистр КоличествоКандидатовПоЭтапам Приход
	Движения.КоличествоКандидатовПоЭтапам.Записывать = Истина;
	Движение = Движения.КоличествоКандидатовПоЭтапам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Вакансия = Вакансия;
	Движение.Кандидат = Кандидат;
	Движение.Этап = Перечисления.ЭтапыПодбора.ПервичноеСобеседование;
	Движение.ДатаИзмененияЭтапа = Дата;
	Движение.Количество = 1;
	
	// регистр КоличествоКандидатовПоЭтапам Расход
	Движения.КоличествоКандидатовПоЭтапам.Записывать = Истина;
	Движение = Движения.КоличествоКандидатовПоЭтапам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Вакансия = Вакансия;
	Движение.Кандидат = Кандидат;
	Движение.Этап = Перечисления.ЭтапыПодбора.ТелефонноеИнтервью;
	Движение.ДатаИзмененияЭтапа = Дата;
	Движение.Количество = 1;
	
КонецПроцедуры

Процедура ЗаписатьРезультатСобеседованияСИнициаторомВРегистр()

	// регистр КоличествоКандидатовПоЭтапам Приход
	Движения.КоличествоКандидатовПоЭтапам.Записывать = Истина;
	Движение = Движения.КоличествоКандидатовПоЭтапам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Вакансия = Вакансия;
	Движение.Кандидат = Кандидат;
	Движение.Этап = Перечисления.ЭтапыПодбора.СобеседованиеСИнициатором;
	Движение.ДатаИзмененияЭтапа = Дата;
	Движение.Количество = 1;
	
	// регистр КоличествоКандидатовПоЭтапам Расход
	Движения.КоличествоКандидатовПоЭтапам.Записывать = Истина;
	Движение = Движения.КоличествоКандидатовПоЭтапам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Вакансия = Вакансия;
	Движение.Кандидат = Кандидат;
	Движение.Этап = Перечисления.ЭтапыПодбора.ПервичноеСобеседование;
	Движение.ДатаИзмененияЭтапа = Дата;
	Движение.Количество = 1;	

КонецПроцедуры

