
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Вакансия") Тогда
		Должность = ДанныеЗаполнения.Должность;
		НаименованиеВакансии = ДанныеЗаполнения.НаименованиеВакансии;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Вакансия = ДанныеЗаполнения.Ссылка;
	КонецЕсли;	

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр КоличествоКандидатовПоЭтапам Приход
	Движения.КоличествоКандидатовПоЭтапам.Записывать = Истина;
	Для Каждого ТекСтрокаКандидаты Из Кандидаты Цикл
		Движение = Движения.КоличествоКандидатовПоЭтапам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Вакансия = Вакансия;
		Движение.Кандидат = ТекСтрокаКандидаты.Кандидат;
		Движение.Этап = Перечисления.ЭтапыПодбора.ПросмотрРезюме;
		Движение.ДатаИзмененияЭтапа = ТекСтрокаКандидаты.ДатаПоступления;
		Движение.Количество = 1;
	КонецЦикла;

КонецПроцедуры

