
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Вакансия") Тогда
		Должность = ДанныеЗаполнения.Должность;
		НаименованиеВакансии = ДанныеЗаполнения.НаименованиеВакансии;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Вакансия = ДанныеЗаполнения.Ссылка;
	КонецЕсли;	

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	ЗаписатьДвиженияКоличествоКандидатовПоЭтапам();
	ЗаписатьДвиженияСтатусыКандидатов();
	
КонецПроцедуры

Процедура ЗаписатьДвиженияКоличествоКандидатовПоЭтапам()

	// регистр накопления КоличествоКандидатовПоЭтапам Приход
	Движения.КоличествоКандидатовПоЭтапам.Записывать = Истина;
	Для Каждого ТекСтрокаКандидаты Из Кандидаты Цикл
		Движение = Движения.КоличествоКандидатовПоЭтапам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Вакансия = Вакансия;
		Движение.Кандидат = ТекСтрокаКандидаты.Кандидат;
		Движение.Этап = Перечисления.ЭтапыПодбора.ПросмотрРезюме;
		Движение.ЭтапПройден = Истина;
		Движение.ДатаИзмененияЭтапа = ТекСтрокаКандидаты.ДатаПоступления;
		Движение.Количество = 1;
	КонецЦикла;	

КонецПроцедуры

Процедура ЗаписатьДвиженияСтатусыКандидатов()

	// регистр сведений СтатусыКандидатов
	Движения.СтатусыКандидатов.Записывать = Истина;
	Для Каждого ТекСтрокаКандидаты Из Кандидаты Цикл
		Движение = Движения.СтатусыКандидатов.Добавить();
		Движение.Период = ТекСтрокаКандидаты.ДатаПоступления;
		Движение.Вакансия = Вакансия;
		Движение.Кандидат = ТекСтрокаКандидаты.Кандидат;
		Движение.ЭтапПройден = Истина;
		Движение.Статус = Перечисления.ЭтапыПодбора.ПросмотрРезюме;
	КонецЦикла;	

КонецПроцедуры





