
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоАдминистратор = ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.ПолныеПрава);
	Если НЕ ЭтоАдминистратор Тогда
		ЭлементОтбора = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ОбщегоНазначенияСервер.ПолучитьПодразделениеТекПользователя(ПараметрыСеанса.ТекущийПользователь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьНавыкИзХХ(Команда)
	
	ОткрытьФорму("Обработка.ЗагрузкаНавыковИзХХ.Форма.Форма",, ЭтотОбъект);
	
КонецПроцедуры


