
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() Тогда	
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
		Объект.Ответственный = ТекущийПользователь.Сотрудник;
		Объект.АвторДокумента = ТекущийПользователь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КандидатПриИзменении(Элемент)
	
	ДанныеКандидата = ПолучитьДанныеКандидата(Объект.Кандидат); 
	
	Объект.ТелефонКандидата = ДанныеКандидата.Телефон;
	Объект.ЭмаилКандидата = ДанныеКандидата.Эмаил;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьДанныеКандидата(Кандидат)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Кандидаты.Телефон КАК Телефон,
		|	Кандидаты.Эмаил КАК Эмаил
		|ИЗ
		|	Справочник.Кандидаты КАК Кандидаты
		|ГДЕ
		|	Кандидаты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Кандидат);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();	
	Выборка.Следующий();
	
	ДанныеКандидата = Новый Структура;
	ДанныеКандидата.Вставить("Телефон", Выборка.Телефон);
	ДанныеКандидата.Вставить("Эмаил", Выборка.Эмаил);
	
	Возврат ДанныеКандидата;
	
КонецФункции

