
Процедура ОбработкаПроведения(Отказ, Режим)

	ЗаписатьДвиженияКоличествоКандидатовПоЭтапам();
	ЗаписатьДвиженияСтатусыКандидатов();
	
КонецПроцедуры

Процедура ЗаписатьДвиженияКоличествоКандидатовПоЭтапам()

	// регистр накопления КоличествоКандидатовПоЭтапам Приход
	Движения.КоличествоКандидатовПоЭтапам.Записывать = Истина;
	Движение = Движения.КоличествоКандидатовПоЭтапам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Вакансия = Вакансия;
	Движение.Кандидат = Кандидат;
	Движение.Этап = Перечисления.ЭтапыПодбора.ОтказКандидату;
	Движение.ЭтапПройден = Истина;
	Движение.ДатаИзмененияЭтапа = Дата;
	Движение.Количество = 1;

	// регистр накопления КоличествоКандидатовПоЭтапам Расход
	Движения.КоличествоКандидатовПоЭтапам.Записывать = Истина;
	Движение = Движения.КоличествоКандидатовПоЭтапам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Вакансия = Вакансия;
	Движение.Кандидат = Кандидат;
	ДанныеПоследнегоЭтапа = ПолучитьПоследнийЭтапКандидата();
	Движение.Этап = ДанныеПоследнегоЭтапа.Этап;
	Движение.ЭтапПройден = ДанныеПоследнегоЭтапа.ЭтапПройден;
	Движение.ДатаИзмененияЭтапа = Дата;
	Движение.Количество = 1;

КонецПроцедуры

Функция ПолучитьПоследнийЭтапКандидата()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыКандидатовСрезПоследних.Статус КАК Статус,
		|	СтатусыКандидатовСрезПоследних.ЭтапПройден КАК ЭтапПройден
		|ИЗ
		|	РегистрСведений.СтатусыКандидатов.СрезПоследних(
		|			,
		|			Вакансия = &Вакансия
		|				И Кандидат = &Кандидат) КАК СтатусыКандидатовСрезПоследних";
	
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	Запрос.УстановитьПараметр("Кандидат", Кандидат);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	ДанныеПоследнегоЭтапа = Новый Структура("Этап, ЭтапПройден", Выборка.Статус, Выборка.ЭтапПройден);

	Возврат ДанныеПоследнегоЭтапа;

КонецФункции

Процедура ЗаписатьДвиженияСтатусыКандидатов()

	// регистр сведений СтатусыКандидатов
	Движения.СтатусыКандидатов.Записывать = Истина;
	Движение = Движения.СтатусыКандидатов.Добавить();
	Движение.Период = Дата;
	Движение.Вакансия = Вакансия;
	Движение.Кандидат = Кандидат;
	Движение.ЭтапПройден = Истина;
	Движение.Статус = Перечисления.ЭтапыПодбора.ОтказКандидату;

КонецПроцедуры
