
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если (Объект.ТочкаМаршрута.Имя = "ОпубликоватьВакансию" ИЛИ Объект.ТочкаМаршрута.Имя = "НачатьПоискКандидатов") И Объект.Должность = Справочники.Должности.МенеджерПоПодбору Тогда
		Объект.Исполнитель = ПараметрыСеанса.ТекущийПользователь;	
	КонецЕсли;
	
	//Если Объект.ТочкаМаршрута.Имя = "ПровестиПервичныеСобеседования" Тогда
	//	Элементы.НайденыПодходящиеКандидаты.Видимость = Истина;
	//Иначе
	//	Элементы.НайденыПодходящиеКандидаты.Видимость = Ложь;
	//КонецЕсли;	
	
КонецПроцедуры
