
Процедура Печать(ТабДок, Ссылка) Экспорт

	Макет = Документы.ПредложениеОРаботе.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПредложениеОРаботе.Дата КАК Дата,
	|	ПредложениеОРаботе.Должность КАК Должность,
	|	ПредложениеОРаботе.Кандидат КАК Кандидат,
	|	ПредложениеОРаботе.Подразделение КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПредложениеОРаботе.Подразделение.РуководительПодразделения) КАК Руководитель,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПредложениеОРаботе.Подразделение.РуководительПодразделения.Должность) КАК ДолжностьРуководителя,
	|	ПредложениеОРаботе.ДатаНачалаРаботы КАК ДатаНачалаРаботы,
	|	ПредложениеОРаботе.Вакансия.ПрофильДолжности.ДолжностныеОбязанности КАК ДолжностныеОбязанности,
	|	ПредложениеОРаботе.ЗарплатаОт КАК ЗарплатаОт,
	|	ПредложениеОРаботе.ЗарплатаДо КАК ЗарплатаДо,
	|	ПредложениеОРаботе.Вакансия.ПрофильДолжности.Условия КАК Условия
	|ИЗ
	|	Документ.ПредложениеОРаботе КАК ПредложениеОРаботе
	|ГДЕ
	|	ПредложениеОРаботе.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		Шапка.Параметры.Организация = Константы.НаименованиеОрганизации.Получить();
			
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;

КонецПроцедуры
