
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтотОбъект.ПараметрыВыбора.Свойство("Наименование") Тогда
		Объект.Наименование = ЭтотОбъект.ПараметрыВыбора.Наименование;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЭтоИнициатор = ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.ИнициаторЗаявки);
	ЭтоРуководитель = ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.РуководительСлужбыПерсонала); 
	
	Если ЭтоИнициатор ИЛИ ЭтоРуководитель Тогда 		
		Если Объект.Подразделение.РуководительПодразделения.Пустая() Тогда
			ПодразделениеОбъект = Объект.Подразделение.ПолучитьОбъект();
			ПодразделениеОбъект.РуководительПодразделения = ТекущийОбъект.Ссылка;
			ПодразделениеОбъект.Записать();
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры
