
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр накопления ЗатратыНаВакансии 
	Движения.ЗатратыНаВакансии.Записывать = Истина;
	Для Каждого ТекСтрокаСтоимостьРазмещения Из СтоимостьРазмещения Цикл
		Движение = Движения.ЗатратыНаВакансии.Добавить();
		Движение.Период = Дата;
		Движение.Вакансия = Вакансия;
		Движение.Сайт = ТекСтрокаСтоимостьРазмещения.Сайт;
		Движение.Сумма = ТекСтрокаСтоимостьРазмещения.Цена;
		Движение.ОбщаяСумма = СуммаПоДокументу;
	КонецЦикла;

	// регистр накопления ЗатратыНаВакансии 
	Движения.ЗатратыНаВакансии.Записывать = Истина;
	Для Каждого ТекСтрокаДополнительныеЗатраты Из ДополнительныеЗатраты Цикл
		Движение = Движения.ЗатратыНаВакансии.Добавить();
		Движение.Период = Дата;
		Движение.Вакансия = Вакансия;
		Движение.Сайт = ТекСтрокаДополнительныеЗатраты.Сайт;
		Движение.Сумма = ТекСтрокаДополнительныеЗатраты.Сумма;
		Движение.ОбщаяСумма = СуммаПоДокументу;
	КонецЦикла;

КонецПроцедуры

