
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ЗатратыНаВакансии 
	Движения.ЗатратыНаВакансии.Записывать = Истина;
	Для Каждого ТекСтрокаСтоимостьРазмещения Из СтоимостьРазмещения Цикл
		Движение = Движения.ЗатратыНаВакансии.Добавить();
		Движение.Период = Дата;
		Движение.Вакансия = Вакансия;
		Движение.ДатаОплаты = ТекСтрокаСтоимостьРазмещения.ДатаОплаты;
		Движение.Сайт = ТекСтрокаСтоимостьРазмещения.Сайт;
		Движение.ТарифныйПлан = ТекСтрокаСтоимостьРазмещения.ТарифныйПлан;
		Движение.Цена = ТекСтрокаСтоимостьРазмещения.Цена;
	КонецЦикла;

КонецПроцедуры
