
&НаКлиенте
Асинх Процедура НайтиКандидатов(Команда)
	
	ОчиститьСообщения();
	СписокКандидатов.Очистить();
	
	Если Вакансия.Пустая() Тогда
		ОбщегоНазначенияКлиент.ВывестиСообщение("Выберите вакансию для поиска");
		Возврат;
	КонецЕсли;
	
	НомерВакансии = СтрРазделить(Вакансия, " ")[1];
	
	HTTPСоединение = Новый HTTPСоединение("localhost", 3000);
	HTTPЗапрос = Новый HTTPЗапрос("/includes/load_responses.php?vacancy_number=" + НомерВакансии);
	HTTPЗапрос.Заголовки.Вставить("Application", "1C_recruitment");
	
	Попытка
		HTTPОтвет = Ждать HTTPСоединение.ПолучитьАсинх(HTTPЗапрос);
		Если HTTPОтвет.КодСостояния <> 200 Тогда
			ОбщегоНазначенияКлиент.ВывестиСообщение("Не удалось загрузить отлкики с сайта университета. Код ответа - " + HTTPОтвет.КодСостояния);
			Возврат;
		КонецЕсли;
		
		Результат = HTTPОтвет.ПолучитьТелоКакСтроку(); 
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Результат);
		ОтветJSON = ПрочитатьJSON(ЧтениеJSON); 
		ЧтениеJSON.Закрыть();
		
		ЗагрузитьКандитовВТЗ(ОтветJSON);
		
		ОбщегоНазначенияКлиент.ВывестиСообщение("Поиск кандидатов на вакансию """ + Строка(Вакансия) + """ - завершен.");
		
	Исключение
		ОбщегоНазначенияКлиент.ВывестиСообщение(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗагрузитьКандитовВТЗ(ОткликиКандидатов) 
	
	КоличествоОткликов = 0;
	ТекДата = ТекущаяДата();

	Для Каждого Кандидат Из ОткликиКандидатов Цикл
		
		Если НЕ Образование.Пустая() И Кандидат.education <> Строка(Образование) Тогда	
			Продолжить;
		КонецЕсли;
		
		Если ПрикрепленоФото И ПустаяСтрока(Кандидат.photo_extension) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если ПрикрепленоРезюме И ПустаяСтрока(Кандидат.resume_extension) Тогда
			Продолжить;
		КонецЕсли;

		КоличествоОткликов = КоличествоОткликов + 1;
		НоваяСтрока = СписокКандидатов.Добавить();
		НоваяСтрока.НомерСтроки = КоличествоОткликов;
		НоваяСтрока.ФИО = Кандидат.name;
		НоваяСтрока.Город = Кандидат.city;
		НоваяСтрока.Метро = Кандидат.metro;			
		НоваяСтрока.Образование = Кандидат.education;
		НоваяСтрока.Пол = Кандидат.sex; 
		
		ДатаРождения = Дата(СтрЗаменить(Кандидат.date_birth, "-", "")); 
		НоваяСтрока.ДатаРождения = ДатаРождения;		
		НоваяСтрока.Возраст = Цел((ТекДата - ДатаРождения) / 60 / 60 / 24 / 365);
		
		НоваяСтрока.Почта = Кандидат.email;
		
		ТелефонКандидата = "+7 (" + Сред(Кандидат.phone, 2, 3) + ") " + Сред(Кандидат.phone, 5, 3) + "-" + Сред(Кандидат.phone, 8, 2) + "-" + Прав(Кандидат.phone, 2); 	
		НоваяСтрока.Телефон = ТелефонКандидата;
		
		НоваяСтрока.ФотоЗагружено = НЕ ПустаяСтрока(Кандидат.photo_extension);
		НоваяСтрока.РезюмеЗагружено = НЕ ПустаяСтрока(Кандидат.resume_extension);
		НоваяСтрока.ИдентификаторКандидата = Кандидат.id;
	КонецЦикла;

КонецПроцедуры
