
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПроверитьСтатусЗаявки(Объект.Заявка.СтатусЗаявки, Отказ)
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	ОтобразитьПричинуОтклонения();
	ОтобразитьСтатусСогласованияЗаявки();	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПроверитьСтатусЗаявки(Объект.Заявка.СтатусЗаявки, Отказ)
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОповеститьОбИзменении(Объект.Заявка);
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаПриИзменении(Элемент)
	ОтобразитьСтатусСогласованияЗаявки();		
КонецПроцедуры


&НаКлиенте
Процедура ОдобритьЗаявку(Команда)
	
	Объект.ОтветственныйЗаЗаявку = ПолучитьОтветственногоЗаЗаявку(Объект.Заявка);
	
	Объект.Согласована = Истина;
	Объект.Отклонена = Ложь;
	Элементы.ПричинаОтклонения.Видимость = Ложь;
	Элементы.ПодробноеОписаниеПричины.Видимость = Ложь;
	
	ОтобразитьСтатусСогласованияЗаявки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьЗаявку(Команда)
	
	Объект.ОтветственныйЗаЗаявку = ПолучитьОтветственногоЗаЗаявку(Объект.Заявка);
	
	Объект.Согласована = Ложь;
	Объект.Отклонена = Истина;
	Элементы.ПричинаОтклонения.Видимость = Истина;
	Элементы.ПодробноеОписаниеПричины.Видимость = Истина;
	
	ОтобразитьСтатусСогласованияЗаявки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьРешение(Команда)
	
	Объект.ОтветственныйЗаЗаявку = ПолучитьОтветственногоЗаЗаявку(Объект.Заявка);
	
	Объект.Согласована = Ложь;
	Объект.Отклонена = Ложь;
	Элементы.ПричинаОтклонения.Видимость = Ложь;
	Элементы.ПодробноеОписаниеПричины.Видимость = Ложь;
	
	ОтобразитьСтатусСогласованияЗаявки();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОтветственногоЗаЗаявку(ЗаявкаНаПодбор)

	ОтветственныйЗаЗаявку = ПараметрыСеанса.ТекущийПользователь.Сотрудник;
	
	УстановитьОтветственногоВЗаявке(ЗаявкаНаПодбор, ОтветственныйЗаЗаявку);
	
	Возврат ОтветственныйЗаЗаявку;

КонецФункции 

&НаСервереБезКонтекста
Процедура УстановитьОтветственногоВЗаявке(ЗаявкаНаПодбор, ОтветственныйЗаЗаявку)

	ЗаявкаОбъект = ЗаявкаНаПодбор.ПолучитьОбъект();	
	ЗаявкаОбъект.ОтветственныйЗаЗаявку = ОтветственныйЗаЗаявку;
	ЗаявкаОбъект.Записать();

КонецПроцедуры

&НаСервере
Процедура ПроверитьСтатусЗаявки(СтатусЗаявки, Отказ)
	
	Если НЕ СтатусЗаявки.Пустая() И СтатусЗаявки <> Перечисления.СтатусыЗаявокНаПодбор.Черновик Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Уже был создан документ ""Согласование заявки"" на основе этой заявки";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьПричинуОтклонения()

	Если Объект.Отклонена Тогда
		Элементы.ПричинаОтклонения.Видимость = Истина;
		Элементы.ПодробноеОписаниеПричины.Видимость = Истина;
	Иначе
		Элементы.ПричинаОтклонения.Видимость = Ложь;
		Элементы.ПодробноеОписаниеПричины.Видимость = Ложь;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьСтатусСогласованияЗаявки()
	
	Если Объект.Заявка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаСтатусСогласования.Видимость = Истина;
	
	Если НЕ Объект.Отклонена И НЕ Объект.Согласована Тогда
		Элементы.ГруппаСтатусСогласования.ЦветФона = Новый Цвет(255, 250, 217); 
		Элементы.ДекорацияКартинкаСтатуса.Картинка = БиблиотекаКартинок.ОформлениеЗнакВосклицательныйЗнак;
		Элементы.ДекорацияСтатусСогласования.Заголовок = "Заявка находится на согласовании";
	ИначеЕсли Объект.Согласована Тогда
		Элементы.ГруппаСтатусСогласования.ЦветФона = Новый Цвет(204, 255, 204); 
		Элементы.ДекорацияКартинкаСтатуса.Картинка = БиблиотекаКартинок.ОформлениеЗнакФлажок;
		Элементы.ДекорацияСтатусСогласования.Заголовок = "Заявка одобрена";
	ИначеЕсли Объект.Отклонена Тогда
		Элементы.ГруппаСтатусСогласования.ЦветФона = Новый Цвет(255, 192, 203); 
		Элементы.ДекорацияКартинкаСтатуса.Картинка = БиблиотекаКартинок.ОформлениеЗнакКрест;
		Элементы.ДекорацияСтатусСогласования.Заголовок = "Заявка отклонена";	
	КонецЕсли;

КонецПроцедуры



