
&НаКлиенте
Асинх Процедура СсылкаНаСайтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОчиститьСообщения();
	
	Если ПустаяСтрока(Объект.СсылкаНаСайт) Тогда
		ОбщегоНазначенияКлиент.ВывестиСообщение("Укажите ссылку на сайт", "Объект.СсылкаНаСайт");
		Возврат;
	КонецЕсли; 
	
	Если Сред(Объект.СсылкаНаСайт, 1, 8) <> "https://" И Сред(Объект.СсылкаНаСайт, 1, 7) <> "http://" Тогда
		ОбщегоНазначенияКлиент.ВывестиСообщение("Указана не ссылка на сайт (начало должно быть - https:// или http://)", "Объект.СсылкаНаСайт");
		Возврат;	
	КонецЕсли;
	
	Попытка
		Ждать ЗапуститьПриложениеАсинх(Объект.СсылкаНаСайт);	
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;	
	
КонецПроцедуры
