 
 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда	
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
		Объект.Ответственный = ТекущийПользователь.Сотрудник;
		Объект.АвторДокумента = ТекущийПользователь;
	КонецЕсли;
		
КонецПроцедуры
 
&НаКлиенте
Процедура ВакансияПриИзменении(Элемент)
	
	ДанныеВакансии = ПолучитьДанныеОВакансии(Объект.Вакансия);
		
	Объект.НаименованиеВакансии = ДанныеВакансии.НаименованиеВакансии;
	Объект.Подразделение = ДанныеВакансии.Подразделение;
    Объект.Должность = ДанныеВакансии.Должность; 
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьДанныеОВакансии(Вакансия)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Вакансия.НаименованиеВакансии КАК НаименованиеВакансии,
		|	Вакансия.Подразделение КАК Подразделение,
		|	Вакансия.Должность КАК Должность
		|ИЗ
		|	Документ.Вакансия КАК Вакансия
		|ГДЕ
		|	Вакансия.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Вакансия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ДанныеВакансии = Новый Структура;
	ДанныеВакансии.Вставить("НаименованиеВакансии", Выборка.НаименованиеВакансии);
	ДанныеВакансии.Вставить("Подразделение", Выборка.Подразделение); 
	ДанныеВакансии.Вставить("Должность", Выборка.Должность);
	
	Возврат ДанныеВакансии;

КонецФункции

