
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаПодбор") Тогда
		// Заполнение шапки
		АвторДокумента = ДанныеЗаполнения.АвторДокумента;
		ИнициаторЗаявки = ДанныеЗаполнения.ИнициаторЗаявки;
		Заявка = ДанныеЗаполнения.Ссылка;		
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Ссылка.Пустая() Тогда
		ИзменитьСтатусЗаявки(Перечисления.СтатусыЗаявокНаПодбор.Согласование);	
	КонецЕсли;
	
КонецПроцедуры 

Процедура ПриЗаписи(Отказ)
	
	Если Согласована Тогда
		ИзменитьСтатусЗаявки(Перечисления.СтатусыЗаявокНаПодбор.ВРаботе);
	ИначеЕсли Отклонена Тогда
		ИзменитьСтатусЗаявки(Перечисления.СтатусыЗаявокНаПодбор.Отклонена);
	ИначеЕсли НЕ Согласована И НЕ Отклонена Тогда
		ИзменитьСтатусЗаявки(Перечисления.СтатусыЗаявокНаПодбор.Согласование);
	КонецЕсли;
	
КонецПроцедуры


Процедура ИзменитьСтатусЗаявки(Статус)
	
	ЗаявкаОбъект = Заявка.ПолучитьОбъект();
	ЗаявкаОбъект.СтатусЗаявки = Статус;
	ЗаявкаОбъект.Записать();
	
КонецПроцедуры 





