
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда	
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
		Объект.Ответственный = ТекущийПользователь.Сотрудник;
		Объект.АвторДокумента = ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьРазмещенияТарифныйПланПриИзменении(Элемент)

	ТекущаяСтрокаТЧ = Элементы.СтоимостьРазмещения.ТекущиеДанные;
	СтоимостьТарифногоПлана = ПолучитьЦенуРазмещенияВакансии(ТекущаяСтрокаТЧ.Сайт, ТекущаяСтрокаТЧ.ТарифныйПлан);
	Если СтоимостьТарифногоПлана = 0 Тогда
		ОбщегоНазначенияКлиент.ВывестиСообщение("Не установлена цена для тарифного плана  - " + ТекущаяСтрокаТЧ.ТарифныйПлан);
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрокаТЧ.Цена = СтоимостьТарифногоПлана;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьЦенуРазмещенияВакансии(Сайт, ТарифныйПлан)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("СайтВакансии", Сайт); 
	ПараметрыОтбора.Вставить("ТарифныйПлан", ТарифныйПлан);
	
	ЦенаВакансии = РегистрыСведений.ТарифыВакансий.ПолучитьПоследнее(, ПараметрыОтбора); 
	
	Возврат ЦенаВакансии.Цена; 	

КонецФункции


